tests/Stripe/Resource/fixture/response/customer/retrieve.json

{
  "id": "cus_9f8ojTFotEFqXB",
  "object": "customer",
  "account_balance": 0,
  "created": 1480575508,
  "currency": "jpy",
  "default_source": null,
  "delinquent": false,
  "description": null,
  "discount": null,
  "email": null,
  "livemode": false,
  "metadata": {
  },
  "shipping": null,
  "sources": {
    "object": "list",
    "data": [
      {
        "id": "card_19MCGYH5bhTTjb4oeasYK0bH",
        "object": "card",
        "address_city": null,
        "address_country": null,
        "address_line1": null,
        "address_line1_check": null,
        "address_line2": null,
        "address_state": null,
        "address_zip": null,
        "address_zip_check": null,
        "brand": "Visa",
        "country": "US",
        "customer": "cus_9fXLtuXnIZdXpF",
        "cvc_check": "pass",
        "dynamic_last4": null,
        "exp_month": 12,
        "exp_year": 2000,
        "fingerprint": "Mx7KCh3ZLIIqC602",
        "funding": "credit",
        "last4": "4242",
        "metadata": {},
        "name": "TEST",
        "tokenization_method": null
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/customers/cus_9f8ojTFotEFqXB/sources"
  },
  "subscriptions": {
    "object": "list",
    "data": [

    ],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/customers/cus_9f8ojTFotEFqXB/subscriptions"
  }
}
